; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v1 ?v6)
             (pred_7 ?v5 ?v9)
             (pred_3 ?v1 ?v9)
             (pred_6 ?v3 ?v1 )
	     (pred_8 ?v1)
             (pred_9 ?v7)
             (pred_2 ?v5)
             (pred_5 ?v9)
             (pred_10 ?v1)
             (pred_11 ?v5)
             (pred_4 ?v1)
             (pred_12 ))



(:action op_1
:parameters (?v2 ?v10 ?v11 ?v13)
:precondition (and (pred_9 ?v2) (pred_9 ?v10) (pred_2 ?v11) (pred_5 ?v13)
          (pred_1 ?v2 ?v10) (pred_7 ?v11 ?v13)
                   (pred_3 ?v10 ?v13) (pred_8 ?v2) 
                   (pred_10 ?v10) (pred_11 ?v11))
:effect (and  (pred_4 ?v10) (not (pred_10 ?v10))))


(:action op_2
:parameters (?v2 ?v8)
:precondition (and (pred_9 ?v2) (pred_9 ?v8)
               (pred_8 ?v2) (pred_1 ?v2 ?v8) (pred_4 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v2))))

(:action op_5
:parameters (?v2 ?v11)
:precondition (and (pred_9 ?v2) (pred_2 ?v11) 
                  (pred_8 ?v2) (pred_6 ?v11 ?v2) (pred_12 ))
:effect (and (pred_11 ?v11)
   (not (pred_6 ?v11 ?v2)) (not (pred_12 ))))


(:action op_4
:parameters (?v2 ?v12 ?v4)
:precondition (and (pred_9 ?v2) (pred_2 ?v12) (pred_2 ?v4)
                  (pred_8 ?v2) (pred_11 ?v4) (pred_6 ?v12 ?v2))
:effect (and (pred_11 ?v12) (pred_6 ?v4 ?v2)
        (not (pred_11 ?v4)) (not (pred_6 ?v12 ?v2))))

(:action op_3
:parameters (?v2 ?v11)
:precondition (and (pred_9 ?v2) (pred_2 ?v11) 
                  (pred_8 ?v2) (pred_11 ?v11))
:effect (and (pred_12 ) (pred_6 ?v11 ?v2) (not (pred_11 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_03 obj_11 obj_08 obj_01 obj_04 obj_06 obj_13 obj_18 obj_20 obj_17 obj_12 obj_02 obj_10 obj_19 obj_16
    obj_07 obj_14
    obj_05 obj_15
    )

    (:init
       (pred_12)

       (pred_9 obj_09)
       (pred_9 obj_03)
       (pred_9 obj_11)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_04)
       (pred_9 obj_06)
       (pred_9 obj_13)
       (pred_9 obj_18)
       (pred_9 obj_20)
       (pred_9 obj_17)
       (pred_9 obj_12)
       (pred_9 obj_02)
       (pred_9 obj_10)
       (pred_9 obj_19)
       (pred_9 obj_16)
       (pred_5 obj_07)
       (pred_5 obj_14)
       (pred_2 obj_05)
       (pred_2 obj_15)

       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_03 obj_09)
       (pred_1 obj_11 obj_06)
       (pred_1 obj_11 obj_08)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_08 obj_13)
       (pred_1 obj_08 obj_11)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_06 obj_17)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_11)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_13 obj_12)
       (pred_1 obj_13 obj_08)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_18 obj_02)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_20 obj_10)
       (pred_1 obj_20 obj_17)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_17 obj_19)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_17 obj_06)
       (pred_1 obj_17 obj_20)
       (pred_1 obj_12 obj_16)
       (pred_1 obj_12 obj_13)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_18)
       (pred_1 obj_10 obj_19)
       (pred_1 obj_10 obj_20)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_19 obj_16)
       (pred_1 obj_19 obj_17)
       (pred_1 obj_19 obj_10)
       (pred_1 obj_16 obj_12)
       (pred_1 obj_16 obj_19)
       (pred_10 obj_19)
       (pred_10 obj_02)
       (pred_3  obj_19 obj_07)
       (pred_3  obj_02 obj_14)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_4 obj_08)
       (pred_4 obj_01)
       (pred_4 obj_04)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_16)

       (pred_7  obj_05 obj_07)
       (pred_7  obj_15 obj_14)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_15 obj_08)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_6 obj_05 obj_17)
       (pred_6 obj_15 obj_20)
    ))
(:constraints
  (always (not (pred_8 obj_06)))
)
)

; plan
1. (op_2 obj_13 obj_08)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_08)
   goals met: 0 of 2
2. (op_5 obj_08 obj_15)
   deleted: (pred_6 obj_15 obj_08) (pred_12)
   added: (pred_11 obj_15)
   goals met: 0 of 2
3. (op_2 obj_08 obj_11)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_11)
   goals met: 0 of 2
4. (op_2 obj_11 obj_03)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_03)
   goals met: 0 of 2
5. (op_2 obj_03 obj_04)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_04)
   goals met: 0 of 2
6. (op_2 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 0 of 2
7. (op_3 obj_20 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_12) (pred_6 obj_15 obj_20)
   goals met: 1 of 2
8. (op_2 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 1 of 2
9. (op_5 obj_04 obj_05)
   deleted: (pred_6 obj_05 obj_04) (pred_12)
   added: (pred_11 obj_05)
   goals met: 1 of 2
10. (op_2 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 1 of 2
11. (op_2 obj_20 obj_17)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_17)
   goals met: 1 of 2
12. (op_3 obj_17 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_12) (pred_6 obj_05 obj_17)
   goals met: 2 of 2
